=begin

6. Сумма покупок. Пользователь вводит поочередно название товара, 
цену за единицу и кол-во купленного товара (может быть нецелым числом). 
Пользователь может ввести произвольное кол-во товаров до тех пор,
 пока не введет "стоп" в качестве названия товара. На основе 
 введенных данных требуетеся:

		Заполнить и вывести на экран хеш, ключами которого являются названия
		 товаров, а значением - вложенный хеш, содержащий цену за единицу товара 
		 и кол-во купленного товара. Также вывести итоговую сумму за каждый товар.

		Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".
	
=end

bag = {}
score = 0 

loop do
	puts 'введите название товара или stop для выхода'
	name = gets.chomp.downcase
		if name == "stop"
			puts "в корзине сейчас: #{bag}\n общая сумма: #{score}"
			break
		end
		if bag.include?(name)
			puts "tovar v korzine!!!   изменим цену и кол-во?  y/n ?"
			change = gets.chomp.downcase
			case change
			when "y"
				puts "меняем цену и кол-во"
			when "n"
				next	
			end
		end
	puts 'введите цену за ед товара'
	money = gets.to_f
	puts 'введите кол-во'
	times = gets.to_i
	puts "цена за  #{name} составляет #{money * times} рублей"
	bag[name] = {money => times}
    score = score + money * times

  puts "в корзине сейчас: #{bag}\n общая сумма всех покупок: #{score}"

end