
puts "сторона 1"
s1 = gets.to_f

puts "сторона 2"
s2 = gets.to_f

puts "сторона 3"
s3 = gets.to_f

sides = [s1,s2,s3].sort

s_side = sides[0] #а если этих значений тысячи? как можно присвоить ?
m_side = sides[1]
l_side = sides[2]

if s_side == l_side && m_side == l_side
	puts "треугольник равнобедренный и равносторонний, но не прямоугольный."
elsif l_side**2 == m_side**2 + s_side**2
		puts "прямоугольный"
	else #s1 == s2 && s1 == s3 && l_side**2 == s_side**2 + m_side**2
		puts "треугольник прямоугольный и равнобедренный" # 4.242640687119285 4.242640687119285 6
end




=begin
	
Смотри, тут вся фишка в том что условное выражение, 
включая elsif работает только один раз для каждого условия.
 Нам же нужно какие-то условия проверять несколько раз потому 
 что треугольник может быть одновременно и прямоугольным, 
 и равнобедренным, например. Можно пойти таким путём:

result = []

if <condition>
  result += 'волшебный'
end

if <condition>
  result += 'очаровательный'
end

if <condition>
  result += 'равнобедренный'
end

puts "Треугольник #{result.join(', ')}."
	
=end